===
Atomic Fact
===
fact.
---

(source_file
  (clause
    (atom
      (unquoted_atom))
    (read_term_end_token)))

===
Atomic Directive
===
:-atom.
---

(source_file
  (directive
    (atom
      (unquoted_atom))
    (read_term_end_token)))

===
Atom with Underscore
===
my_fact.
---

(source_file
  (clause
    (atom
      (unquoted_atom))
    (read_term_end_token)))

===
Directive with space
===
:- thing.
---

(source_file
  (directive
    (atom
      (unquoted_atom))
    (read_term_end_token)))

===
Quoted atom
===
'asdf'.
---

(source_file
  (clause
    (atom
      (quoted_atom
        (single_quoted_content)))
    (read_term_end_token)))

===
Quoted format string
===
'asdf~nasdf'.
---

(source_file
  (clause
    (atom
      (quoted_atom
        (single_quoted_content)
        (format_string_placeholder)
        (single_quoted_content)))
    (read_term_end_token)))

===
Quoted atom with character escape
===
'asdf\nasdf'.
---

(source_file
  (clause
    (atom
      (quoted_atom
        (single_quoted_content)
        (single_quoted_character_escape)
        (single_quoted_content)))
    (read_term_end_token)))

===
Quoted atom with character escape and format string placeholder
===
:- 'qwerty\npoiu~~lkjhg'.
---

(source_file
  (directive
    (atom
      (quoted_atom
        (single_quoted_content)
        (single_quoted_character_escape)
        (single_quoted_content)
        (format_string_placeholder)
        (single_quoted_content)))
    (read_term_end_token)))

===
Double quoted string
===
"asdf".
---

(source_file
  (clause
    (string
      (double_quoted_string
        (double_quoted_content)))
    (read_term_end_token)))

===
Double quoted string with character escape
===
"as\ndf".
---

(source_file
  (clause
    (string
      (double_quoted_string
        (double_quoted_content)
        (double_quoted_character_escape)
        (double_quoted_content)))
    (read_term_end_token)))

===
Double quoted string with escaped double quote
===
"as\"df".
---

(source_file
  (clause
    (string
      (double_quoted_string
        (double_quoted_content)
        (double_quoted_character_escape)
        (double_quoted_content)))
    (read_term_end_token)))

===
Simple compound term
===
compound(term).
---

(source_file
  (clause
    (compound_term
      (atom
        (unquoted_atom))
      (atom
        (unquoted_atom)))
    (read_term_end_token)))

===
Quoted functor compound term
===
'this is a functor'(blah).
---

(source_file
  (clause
    (compound_term
      (atom
        (quoted_atom
          (single_quoted_content)))
      (atom
        (unquoted_atom)))
    (read_term_end_token)))

===
Variable - single letter
===
anything(X).
---

(source_file
  (clause
    (compound_term
      (atom
        (unquoted_atom))
      (variable))
    (read_term_end_token)))

===
Variable - underscore
===
anything(_).
---

(source_file
  (clause
    (compound_term
      (atom
        (unquoted_atom))
      (variable))
    (read_term_end_token)))

===
Variable - multi-letter
===
anything(Asdf).
---

(source_file
  (clause
    (compound_term
      (atom
        (unquoted_atom))
      (variable))
    (read_term_end_token)))

===
Variable - all kinds of characters
===
anything(QWerty43_51X).
---

(source_file
  (clause
    (compound_term
      (atom
        (unquoted_atom))
      (variable))
    (read_term_end_token)))

===
Multiple arguments in compound term
===
append(A, B, C).
---

(source_file
  (clause
    (compound_term
      (atom
        (unquoted_atom))
      (variable)
      (variable)
      (variable))
    (read_term_end_token)))

===
List - empty
===
[].
---

(source_file
  (clause
    (list_literal)
    (read_term_end_token)))

===
List - one item
===
[a].
---

(source_file
  (clause
    (list_literal
      (atom
        (unquoted_atom)))
    (read_term_end_token)))

===
List - two items
===
[a, b].
---

(source_file
  (clause
    (list_literal
      (atom
        (unquoted_atom))
      (atom
        (unquoted_atom)))
    (read_term_end_token)))

===
List - simple cons
===
[a | b].
---

(source_file
  (clause
    (list_literal
      (atom
        (unquoted_atom))
      (atom
        (unquoted_atom)))
    (read_term_end_token)))

===
List - multi-item and cons
===
[a, b, c | tail].
---

(source_file
  (clause
    (list_literal
      (atom
        (unquoted_atom))
      (atom
        (unquoted_atom))
      (atom
        (unquoted_atom))
      (atom
        (unquoted_atom)))
    (read_term_end_token)))

===
Number - decimal (no sign)
===
1234.
---

(source_file
  (clause
    (number)
    (read_term_end_token)))

===
Number - decimal zero
===
0.
---

(source_file
  (clause
    (number)
    (read_term_end_token)))

===
Number - signed zero
===
pair(-0, +0).
---

(source_file
  (clause
    (compound_term
      (atom
        (unquoted_atom))
      (number)
      (number))
    (read_term_end_token)))

===
Number - decimal (signed)
===
pair(-345, +632).
---

(source_file
  (clause
    (compound_term
      (atom
        (unquoted_atom))
      (number)
      (number))
    (read_term_end_token)))

===
Number - binary
===
0b00101011.
---

(source_file
  (clause
    (number)
    (read_term_end_token)))

===
Number - octal
===
0o3427.
---

(source_file
  (clause
    (number)
    (read_term_end_token)))

===
Number - hexadecimal
===
0x2a1f3e5.
---

(source_file
  (clause
    (number)
    (read_term_end_token)))

===
Operator term - simple
===
a + b.
---

(source_file
  (clause
    (operator_term
      (atom
        (unquoted_atom))
      (operator)
      (atom
        (unquoted_atom)))
    (read_term_end_token)))

===
Operator term - two operators
===
a + b * c.
---

(source_file
  (clause
    (operator_term
      (atom
        (unquoted_atom))
      (operator)
      (operator_term
        (atom
          (unquoted_atom))
        (operator)
        (atom
          (unquoted_atom))))
    (read_term_end_token)))

===
Operator term - multiple of same
===
a + b + b + c.
---

(source_file
  (clause
    (operator_term
      (atom
        (unquoted_atom))
      (operator)
      (operator_term
        (atom
          (unquoted_atom))
        (operator)
        (operator_term
          (atom
            (unquoted_atom))
          (operator)
          (atom
            (unquoted_atom)))))
    (read_term_end_token)))

===
Operator term - multi-character operator
===
a +--+ b.
---

(source_file
  (clause
    (operator_term
      (atom
        (unquoted_atom))
      (operator)
      (atom
        (unquoted_atom)))
    (read_term_end_token)))

===
Operator term - operator in compound term
===
thing(A + B, 1 - 2).
---

(source_file
  (clause
    (compound_term
      (atom
        (unquoted_atom))
      (operator_term
        (variable)
        (operator)
        (operator_term
          (variable)
          (operator)
          (operator_term
            (number)
            (operator)
            (number)))))
    (read_term_end_token)))

===
Operator term - operator in list
===
[A + B, 1 - 2].
---

(source_file
  (clause
    (list_literal
      (operator_term
        (variable)
        (operator)
        (operator_term
          (variable)
          (operator)
          (operator_term
            (number)
            (operator)
            (number)))))
    (read_term_end_token)))

===
Append
===
append([], Ys, Ys).
append([X|Xs], Ys, [X|XsYs]) :-
    append(Xs, Ys, XsYs).
---

(source_file
  (clause
    (compound_term
      (atom
        (unquoted_atom))
      (list_literal)
      (variable)
      (variable))
    (read_term_end_token))
  (clause
    (operator_term
      (compound_term
        (atom
          (unquoted_atom))
        (list_literal
          (variable)
          (variable))
        (variable)
        (list_literal
          (variable)
          (variable)))
      (operator)
      (compound_term
        (atom
          (unquoted_atom))
        (variable)
        (variable)
        (variable)))
    (read_term_end_token)))

===
Parenthesized
===
blah( (x) ).
---

(source_file
  (clause
    (compound_term
      (atom
        (unquoted_atom))
      (parenthesized_term
        (atom
          (unquoted_atom))))
    (read_term_end_token)))

===
Curly Braced Term
===
{ 1, 2, 3 }.
---

(source_file
  (clause
    (curly_braced_term
      (operator_term
        (number)
        (operator)
        (operator_term
          (number)
          (operator)
          (number))))
    (read_term_end_token)))
